## LAB CYCLE 1

### EXERCISE 4: Introduction to Pandas

1.Write a python program to implement List-to-Series Conversion.

In [3]:
import pandas as pd

list = ['Apple','Orange','Banana','Peach','Strawberry']

series = pd.Series(list)

print(series)

0         Apple
1        Orange
2        Banana
3         Peach
4    Strawberry
dtype: object

2.Write  a  python  program  to Generate  the  series  of  dates  from  1st  May,  2021  to  12th May, 2021 (both inclusive).

In [6]:
import pandas as pd
date_series = pd.date_range(start = '05-01-2021', end = '05-12-2021')

print(date_series)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

3.Given a dictionary, convert it into corresponding dataframe and display it.

In [8]:
import pandas as pd
dictionary = {'name': ['Aparna', 'Megha', 'Arya','Adeeshaya'],
              'age' : [22, 23, 25,22],
              'course' : ['MCA', 'Btech', 'MSC','Phd']}

dataframe = pd.DataFrame(dictionary)

print(dataframe)

        name  age course
0     Aparna   22    MCA
1      Megha   23  Btech
2       Arya   25    MSC
3  Adeeshaya   22    Phd

4.Given a 2D List, convert it into corresponding dataframe and display it.

In [10]:
lists = [[1, 'Aparna Raj', 22],
         [2, 'Aparna PM', 23],
         [3, 'Arya Mohan', 22]]

dataframe = pd.DataFrame(lists, columns = ['id', 'name', 'age'])

print(dataframe)

   id        name  age
0   1  Aparna Raj   22
1   2   Aparna PM   23
2   3  Arya Mohan   22

5.Given a CSV file, read it into a dataframe and display it

In [18]:
dataframe = pd.read_csv('data.csv')

print(dataframe)

   id        Name  Age Course
0   1   Adeeshaya   21    MCA
1  21   Aparna PM   22    Msc
2  24  Arya Moahn   23  Btech

6.Given a dataframe, sort it by multiple columns.

In [19]:
print(dataframe) # original dataframe

print()

dataframe_sorted = dataframe.sort_values(by = ['id', 'Age']) # dataframe after sorting by 'id' and 'age'

print(dataframe_sorted)

   id        Name  Age Course
0   1   Adeeshaya   21    MCA
1  21   Aparna PM   22    Msc
2  24  Arya Moahn   23  Btech

   id        Name  Age Course
0   1   Adeeshaya   21    MCA
1  21   Aparna PM   22    Msc
2  24  Arya Moahn   23  Btech

7.Given  a dataframe  with  custom  indexing,  convert  and  it  to  default  indexing  and display it.

In [22]:
print(dataframe) # printing the original dataframe with custom indexing

print()

dataframe = dataframe.reset_index()

print(dataframe) # printing the dataframe with default indexes

   id        Name  Age Course
0   1   Adeeshaya   21    MCA
1  21   Aparna PM   22    Msc
2  24  Arya Moahn   23  Btech

   index  id        Name  Age Course
0      0   1   Adeeshaya   21    MCA
1      1  21   Aparna PM   22    Msc
2      2  24  Arya Moahn   23  Btech

8.Given a dataframe, select first 2 rows and output them.

In [25]:
print(dataframe) # original dataframe

print()

row = dataframe.iloc[[0,1], :] # extracting the 1st 2 rows of the dataframe

print("Data frame after extracting first teo rows")
print(row)

   index  id        Name  Age Course
0      0   1   Adeeshaya   21    MCA
1      1  21   Aparna PM   22    Msc
2      2  24  Arya Moahn   23  Btech

Data frame after extracting first teo rows
   index  id       Name  Age Course
0      0   1  Adeeshaya   21    MCA
1      1  21  Aparna PM   22    Msc

9.Given  is  a  dataframe  showing  name,  occupation,  salary  of  people.  Find  the  average salary per occupation.

In [38]:
dataframe2 = pd.read_csv('data2.csv')
print(dataframe2) # original dataframe

print()
print("Average salary per occupation")
print()
occ_average_age = dataframe2.groupby('Occupation')['Salary'].mean() # required dataframe

print(occ_average_age)

         Name     Occupation   Salary
0  Aparna Raj         Intern  10000.0
1   Raj Mohan  Bank employee      NaN
2       Deepa       Engineer  50000.0
3       Vinod      Busniness  35000.0
4      Vikram    Electircian      NaN

Average salary per occupation

Occupation
Bank employee        NaN
Busniness        35000.0
Electircian          NaN
Engineer         50000.0
Intern           10000.0
Name: Salary, dtype: float64

10.Given a dataframe with NaN Values, fill the NaN values with 0.

In [40]:
print(dataframe2) # original dataframe

print()
print("After filling Nan with 0:")
print()
dataframe_nullfill = dataframe2.fillna(0)

print(dataframe_nullfill) # dataframe after filling NaN values with 1

         Name     Occupation   Salary
0  Aparna Raj         Intern  10000.0
1   Raj Mohan  Bank employee      NaN
2       Deepa       Engineer  50000.0
3       Vinod      Busniness  35000.0
4      Vikram    Electircian      NaN

After filling Nan with 0:

         Name     Occupation   Salary
0  Aparna Raj         Intern  10000.0
1   Raj Mohan  Bank employee      0.0
2       Deepa       Engineer  50000.0
3       Vinod      Busniness  35000.0
4      Vikram    Electircian      0.0

11.Given  is  a  dataframe  showing  Company  Names  (cname)  and  corresponding  Profits (profit).  Convert the  values  of  Profit  column  such that  values  in  it  greater than  0  are set to True and the rest are set to False.

In [44]:
company = pd.read_csv('company.csv')
print(company) # original dataframe

print()

company['profit'] = company['profit'].apply(lambda x:x>0)

print(company) # required dataframe

       cname  profit
0  Company 1  -10000
1  Comapny 2   10000
2  Comapny 3   -5000
3  Comapny 4   15000
4  Comapny 5   20000

       cname  profit
0  Company 1   False
1  Comapny 2    True
2  Comapny 3   False
3  Comapny 4    True
4  Comapny 5    True

12.Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee Name (ename) and Stipend (stipend) and the other dataframe containing Employee ID (eid) and designation of the employee (designation). Output the Dataframe containing Employee   ID   (eid),   Employee   Name   (ename),   Stipend   (stipend)   and   Position (position)

In [46]:
emp1 = pd.read_csv('emp1_data.csv')
emp2 = pd.read_csv('emp2_data.csv')
print(emp1) # 1st DataFrame containing employee id (eid), employee name (ename) and stipend

print()

print(emp2) # 2nd DataFrame containing employee id (eid) and designation of the employee (position)

print()

dataframe = pd.merge(emp1, emp2, how = 'inner', on = 'eid') # required dataframe

print(dataframe)

   eid       ename  stipend
0    1      Aparna    10000
1    2  Arya mohan    12000
2    3   Aparna PM    15000
3    4     Ashitam     9000

   eid designation
0    1  Trivandrum
1    2      Kollam
2    3      Kannur
3    4  Trivandrum

   eid       ename  stipend designation
0    1      Aparna    10000  Trivandrum
1    2  Arya mohan    12000      Kollam
2    3   Aparna PM    15000      Kannur
3    4     Ashitam     9000  Trivandrum